In [1]:
pip install numpy

Requirement already satisfied: numpy in c:\users\comp1\miniconda3\envs\analysis\lib\site-packages (2.4.2)
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\comp1\miniconda3\envs\analysis\lib\site-packages (3.0.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\comp1\miniconda3\envs\analysis\lib\site-packages (from pandas) (2.4.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\comp1\miniconda3\envs\analysis\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata in c:\users\comp1\miniconda3\envs\analysis\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\comp1\miniconda3\envs\analysis\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [5]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}

df = pd.DataFrame(data)
print(df)

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [6]:
cat = df.groupby('Store')['Sales'].sum()
cat

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [7]:
cat = df.groupby(['Category','Store'])['Sales'].sum()
cat

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

In [8]:
df['Sales'].mean()

np.float64(187.5)

In [9]:
df['Sales'].agg(['mean', 'sum', 'max', 'min'])

mean     187.5
sum     1500.0
max      300.0
min      100.0
Name: Sales, dtype: float64

In [ ]:
//pivot table

In [11]:
import numpy as np

In [12]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    720     32   John  January      Q1
1  2023-01-02       B   West    153     98   Mary  January      Q1
2  2023-01-03       C  North    670     35    Bob  January      Q1
3  2023-01-04       D  South    853     60  Alice  January      Q1
4  2023-01-05       A   East    717     15   John  January      Q1
5  2023-01-06       B   West    475     70   Mary  January      Q1
6  2023-01-07       C  North    683     79    Bob  January      Q1
7  2023-01-08       D  South    169     34  Alice  January      Q1
8  2023-01-09       A   East    751     48   John  January      Q1
9  2023-01-10       B   West    833     67   Mary  January      Q1
10 2023-01-11       C  North    925     57    Bob  January      Q1
11 2023-01-12       D  South    329     58  Alice  January      Q1
12 2023-01-13       A   East    446     29   John  January      Q1
13 2023-01-14       B   West    325     52   Mary  January      Q1
14 2023-01-15       C  North    144     66    Bob  January      Q1
15 2023-01-16       D  South    963     86  Alice  January      Q1
16 2023-01-17       A   East    616     77   John  January      Q1
17 2023-01-18       B   West    791     43   Mary  January      Q1
18 2023-01-19       C  North    342     12    Bob  January      Q1
19 2023-01-20       D  South    366     68  Alice  January      Q1

In [13]:
pd.pivot_table(df, values='Sales', index='Month', columns='Region', aggfunc='sum')

Region   East  North  South  West
Month
January  3250   2764   2680  2577

In [14]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [15]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [17]:
df1.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [18]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [19]:
def square(x):
    return x ** 2

In [20]:
df1['B'] = df1['B'].apply(square)
df1

   A     B    C
0  1   100  100
1  2   400  200
2  3   900  300
3  4  1600  400
4  5  2500  500